# Import Libraries and Load the Data

## First, import the necessary libraries and load the dataset into a pandas DataFrame.

In [161]:
import pandas as pd
import numpy as np
import seaborn as sns
import matplotlib.pyplot as plt # For visualizing data.
%matplotlib inline
import datetime

## Load the dataset

In [162]:
bank_datadf = pd.read_csv('../data/myusabank.csv')

## Preview the dataset

In [163]:
df = pd.read_csv('../data/myusabank.csv')
df.head(5)

,Date,Interest_Income,Interest_Expense,Average_Earning_Assets,Net_Income,Total_Assets,Shareholder_Equity,Operating_Expenses,Operating_Income,Market_Share,Stock_Price
0,1/3/2022,2121958.0,773237,55001045,1572212.0,95404302,23496605,811672,3494178,24,128
1,1/4/2022,2671155.0,518070,54463418,1336326.0,86440010,24948600,1030817,3231496,20,63
2,1/5/2022,2131932.0,797921,59771802,1224137.0,88674163,26416438,1345961,3692148,22,196
3,1/6/2022,2365838.0,556958,54345760,1452268.0,97221407,29694095,1289921,4779685,14,177
4,1/7/2022,2259178.0,1746222,57153768,3858336.0,98279553,25311499,1432303,4764985,10,103

In [164]:
df.tail(5)

,Date,Interest_Income,Interest_Expense,Average_Earning_Assets,Net_Income,Total_Assets,Shareholder_Equity,Operating_Expenses,Operating_Income,Market_Share,Stock_Price
518,3/3/2023,2513153.0,551934,55397662,1554736.0,96040922,21265898,1068252,4022145,18,169
519,8/23/2022,NaN,866329,50421240,NaN,82229180,21551330,921373,3842210,23,53
520,5/4/2022,2106530.0,736175,51910705,1331770.0,98827165,29454531,973260,3833525,20,123
521,1/18/2023,2879989.0,561476,52562469,1810694.0,83138744,25418952,1141416,4241968,26,142
522,3/23/2023,2811774.0,737027,58204298,1793719.0,82627144,22164412,1160244,4478768,14,106

## Find data information

In [165]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 523 entries, 0 to 522
Data columns (total 11 columns):
 #   Column                  Non-Null Count  Dtype
---  ------                  --------------  -----
 0   Date                    523 non-null    object
 1   Interest_Income         471 non-null    float64
 2   Interest_Expense        523 non-null    int64
 3   Average_Earning_Assets  523 non-null    int64
 4   Net_Income              471 non-null    float64
 5   Total_Assets            523 non-null    int64
 6   Shareholder_Equity      523 non-null    int64
 7   Operating_Expenses      523 non-null    int64
 8   Operating_Income        523 non-null    int64
 9   Market_Share            523 non-null    int64
 10  Stock_Price             523 non-null    int64
dtypes: float64(2), int64(8), object(1)
memory usage: 45.1+ KB

## Find  Columns and Rows

In [166]:
df.shape

(523, 11)

# Data Cleaning and Preprocessing

## Check for null values

In [167]:
df.isnull().sum()
print(df.isnull().sum())

Date                       0
Interest_Income           52
Interest_Expense           0
Average_Earning_Assets     0
Net_Income                52
Total_Assets               0
Shareholder_Equity         0
Operating_Expenses         0
Operating_Income           0
Market_Share               0
Stock_Price                0
dtype: int64

### Drop null values

In [168]:
df.dropna(inplace = True)

### Check for null values after Drop null values if any

In [169]:
#df.isnull().sum()
#print(df.isnull().sum())
df.shape

(471, 11)

## Handling Duplicates 
Check for duplicates and remove them if present

### Check duplicates

In [170]:
#df.duplicated().sum()
duplicates = df.duplicated().sum()
print(f"Number of duplicate rows: {duplicates}")

Number of duplicate rows: 21

### Remove duplicates

In [171]:
df = df.drop_duplicates()

### Check duplicates if any

In [172]:
df.duplicated().sum()
#duplicates = df.duplicated().sum()
#print(f"Number of duplicate rows: {duplicates}")

np.int64(0)

## Find all columns name

In [173]:
df.columns

Index(['Date', 'Interest_Income', 'Interest_Expense', 'Average_Earning_Assets',
       'Net_Income', 'Total_Assets', 'Shareholder_Equity',
       'Operating_Expenses', 'Operating_Income', 'Market_Share',
       'Stock_Price'],
      dtype='object')

## Check Data Type

In [174]:
df.dtypes

Date                       object
Interest_Income           float64
Interest_Expense            int64
Average_Earning_Assets      int64
Net_Income                float64
Total_Assets                int64
Shareholder_Equity          int64
Operating_Expenses          int64
Operating_Income            int64
Market_Share                int64
Stock_Price                 int64
dtype: object

### Check skewness

In [175]:
df.skew(numeric_only = 'True')

Interest_Income           0.066883
Interest_Expense          3.670733
Average_Earning_Assets   -0.033531
Net_Income                2.599736
Total_Assets              0.007236
Shareholder_Equity        0.159052
Operating_Expenses        0.040829
Operating_Income          0.059995
Market_Share              0.014802
Stock_Price               0.021435
dtype: float64

Describe() method returns description of the data in the data DataFrame.

In [176]:
df.describe()

,Interest_Income,Interest_Expense,Average_Earning_Assets,Net_Income,Total_Assets,Shareholder_Equity,Operating_Expenses,Operating_Income,Market_Share,Stock_Price
count,4.500000e+02,4.500000e+02,4.500000e+02,4.500000e+02,4.500000e+02,4.500000e+02,4.500000e+02,4.500000e+02,450.000000,450.000000
mean,2.493105e+06,7.901872e+05,5.514276e+07,1.589052e+06,8.991146e+07,2.482550e+07,1.099544e+06,3.985466e+06,19.464444,126.066667
std,2.926169e+05,3.295992e+05,2.887246e+06,4.878065e+05,5.594602e+06,2.857464e+06,2.243381e+05,5.802948e+05,5.755588,42.620091
min,2.002869e+06,5.010150e+05,5.006432e+07,1.007906e+06,8.010073e+07,2.001968e+07,7.065300e+05,3.000159e+06,10.000000,50.000000
25%,2.235993e+06,6.129992e+05,5.269445e+07,1.260571e+06,8.488510e+07,2.232343e+07,9.031442e+05,3.512030e+06,14.000000,92.000000
50%,2.475174e+06,7.202975e+05,5.528107e+07,1.553584e+06,8.988052e+07,2.448491e+07,1.110432e+06,3.942739e+06,19.500000,124.000000
75%,2.742374e+06,8.671992e+05,5.758666e+07,1.793312e+06,9.460157e+07,2.729990e+07,1.284741e+06,4.514281e+06,24.000000,162.000000
max,2.999890e+06,2.967591e+06,5.998821e+07,3.999402e+06,9.995132e+07,2.999215e+07,1.497622e+06,4.999284e+06,29.000000,199.000000

## Data Type Conversion

#### Convert 'Date' column to datetime format.
    Ensure the Date column is in datetime format.

In [177]:
df['Date'] = pd.to_datetime(df['Date'])
#df.loc[row_indexer, col_indexer] = value instead

## Scaling and Normalization

In [182]:
#scaler = StandardScaler()
#df[columns_to_scale] = scaler.fit_transform(df[columns_to_scale])
#df.StandardScaler()
columns_to_scale = ['Interest_Income', 'Interest_Expense', 'Average_Earning_Assets', 
                    'Net_Income', 'Total_Assets', 'Shareholder_Equity', 
                    'Operating_Expenses', 'Operating_Income', 'Market_Share', 'Stock_Price']

# Remove columns

## Select only the 'Date' and 'Close' columns

In [179]:
# Convert the date column to datetime format (assuming your date column is named 'Date')
df['Date'] = pd.to_datetime(df['Date'])

# Define the date range as strings
start_date = 'YYYY-MM-DD'
end_date = 'YYYY-MM-DD'
# Select only the 'Date' and 'Close' columns
bank_df = df[['Date', 'Stock_Price']]

# Display the first few rows of the selected data
bank_df.head()

        Date  Stock_Price
0 2022-01-03          128
1 2022-01-04           63
2 2022-01-05          196
3 2022-01-06          177
4 2022-01-07          103

In [180]:
bank_df.tail()

          Date  Stock_Price
494 2023-12-22          195
495 2023-12-26          104
496 2023-12-27          169
497 2023-12-28          124
498 2023-12-29           70

In [181]:
bank_df.dtypes

Date           datetime64[ns]
Stock_Price             int64
dtype: object